verification/runs/T-family/T5_runs/T5_CUBE_f/0.orig/air/nut
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0/air";
    object nut;
}

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value uniform 0;
    }
    outlet
    {
        type calculated;
        value uniform 0;
    }
    symmetry
    {
        type symmetryPlane;
    }
    side
    {
        type calculated;
        value uniform 0;
    }
    floor
    {
        type nutLowReWallFunction;
        value uniform 0;
    }
    roof
    {
        type nutLowReWallFunction;
        value uniform 0;
    }
    cube_front
    {
        type nutLowReWallFunction;
        value uniform 0;
    }
    cube_top
    {
        type nutLowReWallFunction;
        value uniform 0;
    }
    cube_rear
    {
        type nutLowReWallFunction;
        value uniform 0;
    }
    cube_side_n
    {
        type nutLowReWallFunction;
        value uniform 0;
    }
}
