verification/runs/T-family/T5_runs/T5_CUBE_f/constant/epoxy/g
FoamFile
{
    version 2.0;
    format ascii;
    class uniformDimensionedVectorField;
    location "constant/epoxy";
    object g;
}

dimensions [0 1 -2 0 0 0 0];
value (0 0 0);
