verification/runs/T-family/T5_runs/T5_CUBE_f/constant/epoxy/thermophysicalProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant/epoxy";
    object thermophysicalProperties;
}

thermoType
{
    type heSolidThermo; mixture pureMixture; transport constIso; thermo hConst;
    equationOfState rhoConst; specie specie; energy sensibleEnthalpy;
}
mixture
{
    specie { molWeight 100; }
    thermodynamics { Hf 0; Cp 1000; }
    transport { kappa 0.24; }
    equationOfState { rho 1200; }
}
