verification/runs/T-family/T5_runs/T5_CUBE_f/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object fvSolution;
}

PIMPLE { nOuterCorrectors 1; }
